{"title":"Omnivium 2.0","tags":"Annunci","author":"Roxas Shadow","date":"01\/08\/2013","text":"Benvenuti nella nuova versione del sito web di Omnivium.<br><br>Era verso il 15 di giugno quando avevo ideato questo template per presentare la tesi per il diploma di scuola superiore. Al cominciare del mio periodo da NEET, e per altri motivi che ora non ricordo (probabilmente derivati dal mio hate verso Wordpress), ho presentato una bozza della mia \"versione\" di Omnivium, basata proprio su quel template che ho portato all'esame.<br>Lo sviluppo vero e proprio si è tenuto nel periodo del sub con gli OnF di Stella, per cui solo Byakko, Simo e Hibari sono a conoscenza dei flame tra me ed Hell, quest'ultimo costantemente preso dalle sue manie di precisione millimetrica di ogni componente.<br><br>Ad ogni modo, siamo riusciti a mettere su una release abbastanza stable de <b>LaCumparola<\/b>.<br>Sostanzialmente si tratta di template in HTML5\/CSS\/Javascript con tante magie per il treddì, sopra al quale vi gira un blog engine in AJAX che si occupa di mostrarvi tutte le news presenti.<br>Salutiamo quindi Wordpress per ritrovarci su una nuova piattaforma che lavora totalmente lato client, la quale è totalmente libera ed open source. Il repository con i sorgenti li trovate <a target=\"_blank\" title=\"\" href=\"https:\/\/github.com\/RoxasShadow\/LaCumparola\">qui<\/a>. Nel caso troviate bug (ce ne sono un paio, ma non fateli notare ad Hell...) non esistate a segnalarceli, nei commenti oppure aprendo una issue nel suddetto repository.<br><br>L'uso di questo nuovo Omnivium è parecchio facile: vi basti sapere che spostando il mouse verso sinistra, troverete il menù che vi indirizzerà tra le pagine più utili del sito, e che premendo il tasto <i>invio<\/i>, la freccetta direzionale destra e sinistra, o le freccette che trovate in basso a destra potrete navigare tra le varie news.<br><br>Detto questo, l'intero staff di Omnivium vi augura di passare delle piacevoli vacanze, in attesa dei vostri feedback!<br>"}